ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/ESM_ESM_52D00000h.xml
		<bitfield id="MSK" width="32" begin="31" end="0" resetval="0x0" description="This is interrupt priority for errors in Group A.  This field is used to indicate which interrupt the corresponding event influences (if enabled) for event group N. Each bit corresponds to event Q where Q = N*32+Bit. This field is only reset by a Power-On-Reset (not warm reset). A global soft reset will set this field to 0.  0x0 - Low Priority Interrupt  0x1 - High Priority Interrupt" range="31:0" rwaccess="R/W"/>
	</register><register id="ESM_PCR_GENERATED_MEMORY_MAP_ERR_GRP_PIN_EN_SET_j" acronym="ESM_PCR_GENERATED_MEMORY_MAP_ERR_GRP_PIN_EN_SET_j" offset="1044" width="32" description="Error Pin Enabled Set register">
		<bitfield id="MSK" width="32" begin="31" end="0" resetval="0x0" description="This is the error pin influence enable set for errors in Group A.  This field is used to enable the mask of events in group N. Each bit corresponds to event Q where Q = N*32+Bit. This field is only reset by a Power-On-Reset (not warm reset). A global soft reset will set this field to 0.  Read:  0x0: Disabled  0x1: Enabled  Write 1'b1 to set enable" range="31:0" rwaccess="R/W1TS"/>
	</register><register id="ESM_PCR_GENERATED_MEMORY_MAP_ERR_GRP_PIN_EN_CLR_j" acronym="ESM_PCR_GENERATED_MEMORY_MAP_ERR_GRP_PIN_EN_CLR_j" offset="1048" width="32" description="Error Pin Enabled Clear register">
		<bitfield id="MSK" width="32" begin="31" end="0" resetval="0x0" description="This is the error pin influence enable clear for errors in Group A.  This field is used to enable the mask of events in group N. Each bit corresponds to event Q where Q = N*32+Bit. This field is only reset by a Power-On-Reset (not warm reset). A global soft reset will set this field to 0.  Read:  0x0: Disabled  0x1: Enabled  Write 1'b1 to clear enable" range="31:0" rwaccess="R/W1TC"/>
	</register><register id="ESM_PCR_GENERATED_MEMORY_MAP_ERR_EXT_GRP_CRIT_EN_SET_j" acronym="ESM_PCR_GENERATED_MEMORY_MAP_ERR_EXT_GRP_CRIT_EN_SET_j" offset="2048" width="32" description="Level Critical Priority Interrupt Enabled Clear register">
		<bitfield id="MSK" width="32" begin="31" end="0" resetval="0x0" description="This is the critical priority interrupt influence enable set for errors in Group A.  This field is used to enable the mask of events in group N.  Each bit corresponds to event Q where Q = N*32+Bit (Example: bit 0 is event N*32+0, bit 1 is N*32 + 1 etc�)  This field is only reset by a Power-On-Reset (not warm reset).  A global soft reset will set this field to 0.  Read:  0x0: Disabled  0x1: Enabled  Write:  0x0: No effect  0x1: Set Enable.  Corresponding event, when set, will count as a pending event towards generating a critical priority interrupt if not cleared by cycle count in the critical priority interrupt delay counter register." range="31:0" rwaccess="R/W1TS"/>
	</register><register id="ESM_PCR_GENERATED_MEMORY_MAP_ERR_EXT_GRP_CRIT_EN_CLR_j" acronym="ESM_PCR_GENERATED_MEMORY_MAP_ERR_EXT_GRP_CRIT_EN_CLR_j" offset="2052" width="32" description="Level Critical Priority Interrupt Enabled Clear register">
		<bitfield id="MSK" width="32" begin="31" end="0" resetval="0x0" description="This is the critical priority interrupt influence enable clear for errors in Group A.  This field is used to enable the mask of events in group N.  Each bit corresponds to event Q where Q = N*32+Bit (Example: bit 0 is event N*32+0, bit 1 is N*32 + 1 etc�)  This field is only reset by a Power-On-Reset (not warm reset).  A global soft reset will set this field to 0.  Read:  0x0: Disabled  0x1: Enabled  Write:  0x0: No effect  0x1: Clear Enable.  Corresponding events will no longer count as pending events towards generating a critical priority interrupt." range="31:0" rwaccess="R/W1TC"/>
	</register>
</module>